#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-nHoYs7BwHyFZds8Z

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
random_password.db_password: Refreshing state... [id=none]
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:220881534007:certificate/399165e3-6c0b-4264-940c-3a960e4b86b0]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.api: Refreshing state... [id=9jt82m]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cmapde]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=uysksd]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-gcp9dahm4c-uysksd-ANY]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api-dev.loginproxy.gov.bc.ca]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=zfeccr]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-cmapde-ANY]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-gcp9dahm4c-uysksd-ANY]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=bsp54p]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-08-22T23:19:54.544Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2022-08-18T21:11:07Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/test" -> (known after apply)
      ~ id            = "bsp54p" -> (known after apply)
      ~ invoke_url    = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "ed728b6bc71158b20d0452d1fbe1b895f15d4bb9"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.openapi_swagger will be created
  + resource "aws_api_gateway_integration" "openapi_swagger" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = (known after apply)
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.header.Content-Disposition" = "method.request.header.Content-Disposition"
          + "integration.request.header.Content-Type"        = "method.request.header.Content-Type"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = "gcp9dahm4c"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:s3:::css-sso-api-swagger"
    }

  # aws_api_gateway_integration.openapi_swagger_assets will be created
  + resource "aws_api_gateway_integration" "openapi_swagger_assets" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = (known after apply)
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.header.Content-Disposition" = "method.request.header.Content-Disposition"
          + "integration.request.header.Content-Type"        = "method.request.header.Content-Type"
          + "integration.request.path.asset"                 = "method.request.path.asset"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = "gcp9dahm4c"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:s3:::css-sso-api-swagger"
    }

  # aws_api_gateway_integration_response.openapi_swagger will be created
  + resource "aws_api_gateway_integration_response" "openapi_swagger" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = "integration.response.header.Content-Disposition"
          + "method.response.header.Content-Type"        = "integration.response.header.Content-Type"
        }
      + rest_api_id         = "gcp9dahm4c"
      + status_code         = "200"
    }

  # aws_api_gateway_integration_response.openapi_swagger_assets will be created
  + resource "aws_api_gateway_integration_response" "openapi_swagger_assets" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = "integration.response.header.Content-Disposition"
          + "method.response.header.Content-Type"        = "integration.response.header.Content-Type"
        }
      + rest_api_id         = "gcp9dahm4c"
      + status_code         = "200"
    }

  # aws_api_gateway_method.openapi_swagger_proxy will be created
  + resource "aws_api_gateway_method" "openapi_swagger_proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Content-Disposition" = true
          + "method.request.header.Content-Type"        = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "gcp9dahm4c"
    }

  # aws_api_gateway_method.swagger_assets_proxy will be created
  + resource "aws_api_gateway_method" "swagger_assets_proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Content-Disposition" = true
          + "method.request.header.Content-Type"        = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "gcp9dahm4c"
    }

  # aws_api_gateway_method_response.openapi_swagger_proxy will be created
  + resource "aws_api_gateway_method_response" "openapi_swagger_proxy" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = true
          + "method.response.header.Content-Type"        = true
        }
      + rest_api_id         = "gcp9dahm4c"
      + status_code         = "200"
    }

  # aws_api_gateway_method_response.swagger_assets_proxy will be created
  + resource "aws_api_gateway_method_response" "swagger_assets_proxy" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = true
          + "method.response.header.Content-Type"        = true
        }
      + rest_api_id         = "gcp9dahm4c"
      + status_code         = "200"
    }

  # aws_api_gateway_resource.openapi_swagger will be created
  + resource "aws_api_gateway_resource" "openapi_swagger" {
      + id          = (known after apply)
      + parent_id   = "irntllxe14"
      + path        = (known after apply)
      + path_part   = "openapi"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_api_gateway_resource.openapi_swagger_proxy will be created
  + resource "aws_api_gateway_resource" "openapi_swagger_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "swagger"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_api_gateway_resource.swagger_assets_proxy will be created
  + resource "aws_api_gateway_resource" "swagger_assets_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{asset}"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_iam_role.s3_read_access_role will be created
  + resource "aws_iam_role" "s3_read_access_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:List*",
                          + "s3:Get*",
                          + "s3-object-lambda:List*",
                          + "s3-object-lambda:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ApiGatewayAmazonS3ReadOnlyAccess"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-08-22T23:19:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "LhskkSQvW8o76CEwyjECe/0Ea1qNR7ckMq3gQgqrq/0=" -> "xXG7dnfZC6ooTMhcr9TwIGH7W7obIYVsnR1OCRYn5Y8="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-08-22T23:20:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "wzrxGy0oGB28l1hL7uQlEA0G0mmGHd3J5W8rr6JHzZs=" -> "WDV2GCVhdJ3aYVdgVrdzgb6VP8LQ85le/UdArW7+5RU="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-08-22T23:19:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "d6MBAWV+sKOT9oRyHH7PNuk8Uehi+hQ9WsLGI/OoWbM=" -> "CHE8h1Tw639teazaJYpVUA/Cmn6JSTKZKDyj6jbaQdI="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-08-22T23:19:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "CnaNNgk/V1STXeyPxcvocuEaf8QSeLukGEaoJPuVEJo=" -> "LO6s+X9dyLRDo4g64ULdJoW73bIRuW2kvBd62hEI59g="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-08-22T23:19:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "NXlYoynEepbRofPqo0ElUJZhW/wpdwYtXMDuSxb6WfA=" -> "vlnVrC4j3G/pWpEC4gl4M343CIFRgOpV56qkN27wv5U="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.s3_keycloak_v2.aws_s3_bucket.swagger will be created
  + resource "aws_s3_bucket" "swagger" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "css-sso-api-swagger"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.swagger_cors_config will be created
  + resource "aws_s3_bucket_cors_configuration" "swagger_cors_config" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }
    }

  # module.s3_keycloak_v2.aws_s3_bucket_public_access_block.swagger_public_access will be created
  + resource "aws_s3_bucket_public_access_block" "swagger_public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 16 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url     = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-08-22T23:19:54.544Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 9 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*